//
//  otvet.h
//  Shahmaty
//
//  Created by Кирилл Броцкий on 25.12.2020.
//  Copyright © 2020 Кирилл Броцкий. All rights reserved.
//

#ifndef otvet_h
#define otvet_h

std::string not_open[5] = {"Xa-xa, такой партии еще не было 😑", "❌ Данная игра не была найдена ❌", "Будьте внимательны, такой партии у меня еще не было 🤨", "Думаю вы немного ошиблись и вам стоит попробовать еще раз 😊", "Вы видимо решили надо мной посмеяться, дам вам последний шанс ввести правильно или я обижусь 🙂"};
std::string soxr[5]={ "Если вы или я захотите отдохнуть, мы всегда сможем вернуться к тому месту где закончили, но для этого необходимо сохранение игры 😎", "Шахматы достаточно длительная игра, давайте я буду все сохранять в процессе нашей игры 😉", "Если что-то пойдет не так, вы всегда сможете вернуться к игре если включено автосохранение ✅", "Выбор автоохранения - выбор сильнейших игроков 💪", "Я предвкушаю длительную игру с Вами, считаю ее обязательно стоит сохранить 💯"};
std::string vopros_partiya[3] = {"Желаете продолжить неоконченную партию? ", "Хотели бы вернуться к незаконченной партии? ", "Готовы продолжить партию? "};
std::string vopros_soxr[3] = {"Мне сохранить нашу партию? ", "Есть заманчивое предложение... сохранить нашу партию! ", "Хотите ли вы включить автоматическое сохранение игры? "};
std::string otvet_soxr[3] = {"Надеюсь в следующий раз вы сделаете правильный выбор 🙂", "Досадно ☹️", "Буду рада в следующий раз сохранить! "};
#endif /* otvet_h */
